[
  {
    "title": "Low-income workers to receive first enhanced Canada Workers Benefit payments ",
    "content": "July 27, 2023 - Ottawa, Ontario - Department of Finance Canada\nStarting tomorrow, millions of low- and modest-income Canadian workers will receive their first automatic advance payments of the newly enhanced Canada Workers Benefit, announced the Deputy Prime Minister and Minister of Finance, Chrystia Freeland.\nEnhancements to the Canada Workers Benefit, first announced in 2021, expanded eligibility to an additional one million workers—and now, support from the enhanced Canada Workers Benefit will come sooner to those who need it most. Prior to the recent passage of Bill C-47, people needed to wait until they filed their taxes to receive this support, which helps them pay for day-to-day essentials like groceries and rent.\nTo top-up the incomes of our lowest-paid—and often most essential—workers, the Canada Workers Benefit will provide up to $2,616 total for an eligible family, and $1,518 total for eligible single workers, split between three advance payments this fiscal year (in July 2023, October 2023, and January 2024), and a final payment after filing their 2023 tax return.\nLow- and modest-income Canadian workers who received the Canada Workers Benefit in 2022 will automatically receive their advance payments from the Canada Revenue Agency, with no need to apply.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/07/low-income-workers-to-receive-first-enhanced-canada-workers-benefit-payments.html"
  },
  {
    "title": "Deputy Prime Minister to attend meetings of G7 and G20 Finance Ministers and Central Bank Governors in India",
    "content": "February 21, 2023 - Ottawa, Canada - Department of Finance Canada\nThis week, from February 23 to 25, the Deputy Prime Minister and Minister of Finance, the Honourable Chrystia Freeland, will attend meetings of the G7 and G20 Finance Ministers and Central Bank Governors in Bengaluru, India.\nAt these meetings, the Deputy Prime Minister will work with Canada’s international partners to address global challenges, including the economic impacts of Putin’s illegal war, elevated inflation, climate change, international tax fairness, and global sovereign debt challenges.\nWhile in Bengaluru, the Deputy Prime Minister will also mark one year since Russia’s illegal invasion of Ukraine. In partnership with Canada’s allies, the Deputy Prime Minister will work to ensure continued support for Ukraine, and to hold Russia accountable for Putin’s assault on the people of Ukraine.\nAn itinerary of events will be released in advance of the meetings.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/02/deputy-prime-minister-to-attend-meetings-of-g7-and-g20-finance-ministers-and-central-bank-governors-in-india.html"
  },
  {
    "title": "Deputy Prime Minister highlights new Early Learning and Child Care Infrastructure Fund in Vancouver",
    "content": "July 6, 2023 - Vancouver, British Columbia - Department of Finance Canada\nToday in Vancouver, the Deputy Prime Minister and Minister of Finance, the Honourable Chrystia Freeland, highlighted how the new Early Learning and Child Care Infrastructure Fund, first announced by the Prime Minister on June 28, 2023, will help public and not-for-profit child care providers deliver affordable child care for families by funding the cost of building more child care spaces.\nAs the federal government works towards making $10-a-day child care a reality for families across the country, it is creating an additional 250,000 child care spaces through existing agreements with provinces and territories. The new Fund will provide an additional $625 million to provinces and territories to create child care spaces in communities that currently do not have enough of them.\nBritish Columbia is working towards reducing fees to an average of $10-a-day by 2026, and has already reduced fees for licensed child care spaces by 50 per cent on average—saving families an average of $6,600 this year.\nThe federal government’s plan is putting thousands of dollars back into the pockets of hardworking families, while also helping parents—particularly mothers—rejoin the workforce and grow our economy. As of May 2023, Canada’s labour force participation rate for women in their prime working years was a near-record high of 85.4 per cent—compared to 77.6 per cent in the United States.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/07/deputy-prime-minister-highlights-new-early-learning-and-child-care-infrastructure-fund-in-vancouver.html"
  },
  {
    "title": "Government delivers new Grocery Rebate to 11 million low- and modest-income Canadians",
    "content": "July 5, 2023 - Lunenburg, Nova Scotia - Department of Finance Canada\nToday, the Honourable Randy Boissonnault, Minister of Tourism and Associate Minister of Finance announced that 11 million low- and modest-income Canadians and families will begin receiving their new, one-time Grocery Rebate.\nThis targeted inflation relief for vulnerable Canadians provides eligible couples with two children up to an extra $467; single Canadians without children up to an extra $234; and seniors with an extra $225, on average. By targeting the Grocery Rebate to the Canadians who need it most, the government is delivering important relief while maintaining Canada’s AAA credit rating and strong track record of fiscal responsibility.\nStarting today, Grocery Rebate payments are being delivered to eligible Canadians by direct deposit or cheque through the Canada Revenue Agency.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/07/government-delivers-new-grocery-rebate-to-11-million-low--and-modest-income-canadians.html"
  },
  {
    "title": "Government delivers new Grocery Rebate to Canadians who need it most",
    "content": "July 5, 2023 - Ottawa, Ontario - Department of Finance Canada\nToday, the Deputy Prime Minister and Minister of Finance, the Honourable Chrystia Freeland, announced that 11 million low- and modest-income Canadians and families will begin receiving their new, one-time Grocery Rebate today.\nThis targeted inflation relief for Canadians who need it most provides eligible couples with two children up to an extra $467; single Canadians without children up to an extra $234; and seniors with an extra $225, on average. By targeting the Grocery Rebate to the Canadians who need it most, the government is delivering important relief while maintaining Canada’s AAA credit rating and strong track record of fiscal responsibility.\nStarting today, Grocery Rebate payments are being delivered to eligible Canadians by direct deposit or cheque through the Canada Revenue Agency.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/07/government-delivers-new-grocery-rebate-to-canadians-who-need-it-most.html"
  },
  {
    "title": "Government of Canada delivers additional $2 billion Canada Health Transfer payment to provinces and territories",
    "content": "June 30, 2023  - Ottawa, Ontario - Department of Finance Canada\nThe Honourable Chrystia Freeland, Deputy Prime Minister and Minister of Finance, today confirmed that the Government of Canada has delivered to provinces and territories an additional $2 billion Canada Health Transfer top-up.\nThis top-up will support provincial and territorial governments in reducing backlogs and responding to urgent pressures in emergency rooms, operating rooms, and pediatric hospitals, and is part of the federal government’s $198.3 billion plan to strengthen public health care in Canada.\nToday’s Canada Health Transfer top-up builds on $6.5 billion in one-time top-ups that the federal government provided to provinces and territories during the pandemic in 2020, 2021, and 2022 to help address extreme pandemic-driven pressures on our public health care system. This top-up is also in addition to the $49.4 billion in Canada Health Transfer funding provided in 2023-24. All Canada Health Transfer payments are allocated on a per-capita basis.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/06/government-of-canada-delivers-additional-2-billion-canada-health-transfer-payment-to-provinces-and-territories.html"
  },
  {
    "title": "Legislation focused on a strong middle class, affordable economy, and healthy future receives Royal Assent",
    "content": "June 22, 2023 - Ottawa, Ontario - Department of Finance Canada\nToday, Bill C-47, the Budget Implementation Act, 2023, received Royal Assent.\nThis legislation will deliver many of the government’s Budget 2023 commitments. Key measures being implemented through Bill C-47 include:",
    "link": "https://www.canada.ca/en/department-finance/news/2023/06/legislation-focused-on-a-strong-middle-class-affordable-economy-and-healthy-future-receives-royal-assent.html"
  },
  {
    "title": "Government of Canada announces appointments",
    "content": "June 22, 2023 - Ottawa, Ontario - Department of Finance Canada\nToday, the Honourable Chrystia Freeland, Deputy Prime Minister and Minister of Finance, announced the appointment of Tashia Batstone and Helen R. del Val, each for a four-year term, and the reappointment of J. Martin Castonguay for a three-year term, to the Board of Directors of the Canada Deposit Insurance Corporation (CDIC).\nThe Deputy Prime Minister also announced the reappointment of Anne Whelan and Greg Stewart to the Board of the Bank of Canada, and the reappointment of Jennifer Reynolds and Robert Wener to the Board of Canada Development Investment Corporation (CDEV), all for three-year terms.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/06/government-of-canada-announces-appointments.html"
  },
  {
    "title": "Deputy Prime Minister welcomes International Monetary Fund findings on Canadian economy",
    "content": "June 20, 2023 - Ottawa, Ontario - Department of Finance Canada\nToday, the Honourable Chrystia Freeland, Deputy Prime Minister and Minister of Finance, welcomed the International Monetary Fund (IMF)’s Staff Concluding Statement of the 2023 Article IV Mission, which highlighted Canada’s resilient economy, stable fiscal outlook, clean economy plan, and actions to improve housing affordability.\nThe IMF’s latest projections reaffirm Canada’s position as the G7 country with the lowest deficit-to-GDP ratio in every year of the IMF’s forecast horizon, and also confirmed that Canada’s net debt-to-GDP ratio remains the lowest among the G7. The report noted “Canada is a strong fiscal performer”, with an enviable fiscal position, and that the job market remains robust, supported by increasing immigration levels and strong labour force participation, which has been “bolstered by the government’s investment in a Canada-wide early learning and child care system.”\nThe IMF also noted the resilience of Canada’s financial system in the face of recent global financial challenges, pointing specifically to Canada’s robust regulatory framework and effective contingency tools to safeguard federally regulated financial institutions and protect insured deposits. The IMF also praised Canada’s progress in strengthening anti-money laundering and anti-terrorist financing (AML/ATF) frameworks, and noted the role of the provinces in helping ensure the success of pan-Canadian efforts for beneficial ownership data collection and publication.\nThe government’s recent investments to grow the clean economy were welcomed by the IMF. The report noted “Canada deserves substantial credit for its multipronged climate mitigation strategy centered around carbon pricing” and believes that these policies “should go a long way toward achieving its nationally determined [emissions reduction] contribution for 2030.”\nThe IMF concluded by highlighting the government’s actions to increase housing supply and address housing affordability challenges, including the new Housing Accelerator Fund, which provides incentives for municipalities to expand housing supply. ",
    "link": "https://www.canada.ca/en/department-finance/news/2023/06/deputy-prime-minister-welcomes-international-monetary-fund-findings-on-canadian-economy.html"
  },
  {
    "title": "Canada extends waiving of tariffs on Ukrainian goods",
    "content": "June 9, 2023 - Ottawa, Ontario - Department of Finance Canada\nThe Deputy Prime Minister and Minister of Finance, the Honourable Chrystia Freeland, today announced that Canada will extend the Ukraine Goods Remission Order until June 9, 2024. This will ensure the continued tariff-free import of Ukrainian goods to Canada, including steel and in-quota supply-managed goods.  \nThe Ukraine Goods Remission Order, in force since June 9, 2022, supports the Ukrainian economy by increasing exports to Canada through the temporary and exceptional remission of customs and trade remedy duties on imports of goods originating in Ukraine.\nToday’s extension builds on the Canada-Ukraine Free Trade Agreement (CUFTA) and its modernization as announced by the Prime Minister on April 11, 2023. Since CUFTA came into force on August 1, 2017, tariffs have been eliminated on 99.9 per cent of imports from Ukraine, including fish and seafood, sunflower oil, and minerals; 99.9 per cent of manufactured products; and 99.9 per cent of agricultural products.\nCanada is committed to standing with the brave people of Ukraine in their defence of Ukraine’s sovereignty and democracy in the face of Russia’s illegal full-scale invasion, which is limiting Ukraine’s ability to export goods to other countries. Canada’s temporary duty relief for Ukrainian goods is among the most comprehensive packages of tariff waivers in the G7 and the world.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/06/canada-extends-waiving-of-tariffs-on-ukrainian-goods.html"
  },
  {
    "title": "Government consults Canadians to advance key Budget 2023 priorities",
    "content": "June 6, 2023 - Ottawa, Ontario - Department of Finance Canada\nThe Government of Canada is today launching a series of consultations with Canadians on Budget 2023 measures to grow the clean economy; create new opportunities for workers; strengthen the government’s ability to fight money laundering and terrorist financing; modernize multinational business taxation to ensure tax fairness for Canadians and Canadian businesses; and consolidate Canada Mortgage Bonds into the Government of Canada’s regular borrowing program, in order to redirect savings to affordable housing programs.\nCanadians are invited to share their views and feedback on the proposed measures as the government works towards implementation of these previously announced priorities.\nThe government is also seeking views on RBC’s proposed acquisition of HSBC Bank Canada.\nGrowing Canada’s Clean Economy was a central pillar of Budget 2023, including a list of clear and predictable investment tax credits. The government is seeking feedback on design details for the:\nAs the Department of Finance works to develop specific design details of these investment tax credits, it welcomes stakeholder organizations and individuals to submit their comments to cleangrowthITC-CIIcroissancepropre@fin.gc.ca.\nLabour requirements will be attached to a number of these investment tax credits, as detailed in Budget 2023. The government will continue to consult with unions and other stakeholders on these tax credits to ensure fair pay for workers.\nAs committed in Budget 2023, the government is consulting with Canadians and Canadian businesses on the reciprocal treatment of its clean economy measures, including domestic content requirements. The government is considering matching other countries’ domestic content requirements with similar restrictions in Canada, in a manner such that any country with incentives open to Canadian business would receive reciprocal treatment in Canadian incentives, while businesses from countries which exclude Canadian businesses would face similar restrictions in Canada.\nEnsuring Fair Opportunities for Canadian Workers with Federal Reciprocal Procurement. This will include ensuring the government buys goods and services from countries that grant Canadian businesses a similar level of access to their government procurement markets and contracts. The government will begin targeted engagement with provinces and territories, industry stakeholders, and workers and unions on concrete reciprocal procurement measures that can be implemented in the near term. Proposed measures will include placing conditions on foreign suppliers’ participation in federally-funded infrastructure projects, including provincial projects, applying strict reciprocity to federal procurement, matching domestic content requirements faced by Canadians companies abroad, and creating a preference program for Canadian small businesses.\nCombatting Money Laundering and Terrorist Financing, as announced in Budget 2023, by strengthening Canada’s Anti-Money Laundering and Terrorist Financing (AML/ATF) Regime. Consultations will examine a broad range of issues to strengthen the AML/ATF Regime, including how different orders of government can collaborate more closely, measures to support investigations and prosecutions, information sharing, closing regulatory gaps, and the role of the AML/ATF Regime in protecting national and economic security. The government is seeking views on the related consultation document, which may be sent to fcs-scf@fin.gc.ca with “Consultation Submission” as the subject line by August 1, 2023. Feedback received from this consultation will complement this year’s Parliamentary review of the Proceeds of Crime (Money Laundering) and Terrorist Financing Act (PCMLTFA).\nReforming and Modernizing Canada’s Transfer Pricing Rules to uphold the integrity of the tax system, ensure tax fairness, and preserve Canada’s attractiveness as a destination for investment and business activity, as committed to in Budget 2021. Transfer pricing rules are used for tax purposes to allocate income or losses connected to cross-border transactions among members of a multinational enterprise group. The Department of Finance is seeking input from stakeholders on the related consultation paper, which may be sent to prixdetransfert-transferpricing@fin.gc.ca by July 28, 2023.\nConsolidating Canada Mortgage Bonds into the regular Government of Canada borrowing program to ensure efficient pricing of government-backed AAA-rated bond offerings. As announced in Budget 2023, reduced borrowing costs from consolidation would allow savings to be redirected to priority affordable housing programs. In the related consultation paper, the government is seeking views on possible market benefits and impacts, as well as how best to proceed with implementation. Interested stakeholders are invited to submit their views to CMBconsultation-consultationsOHC@fin.gc.ca, with “Consultation on the proposal to consolidate CMBs” as the subject line, before July 14, 2023.\nRoyal Bank of Canada’s Proposed Acquisition of HSBC Bank Canada was announced on November 29, 2022. Under the Bank Act, the Minister of Finance is responsible for determining whether or not the proposed acquisition should be approved, including whether any conditions on approval should be imposed. In addition to regulatory reviews by the Competition Bureau (announced May 1, 2023) and the Office of the Superintendent of Financial Institutions, the Department of Finance invites comments on whether the proposed acquisition is in the best interest of Canadians and the Canadian financial sector. Views and feedback from Canadians will inform the Minister of Finance’s decision, and can be submitted to transactions@fin.gc.ca before July 6, 2023. ",
    "link": "https://www.canada.ca/en/department-finance/news/2023/06/government-consults-canadians-to-advance-key-budget-2023-priorities.html"
  },
  {
    "title": "Government announces appointment to the Bank of Canada’s Board of Directors ",
    "content": "May 31, 2023 - Ottawa, Ontario - Department of Finance Canada\nToday, the Honourable Chrystia Freeland, Deputy Prime Minister and Minister of Finance, announced the appointment of Carlos Leitão to the Board of Directors of the Bank of Canada for a term ending on February 28, 2025. ",
    "link": "https://www.canada.ca/en/department-finance/news/2023/05/government-announces-appointment-to-the-bank-of-canadas-board-of-directors.html"
  },
  {
    "title": "Government announces appointment to the Canada Deposit Insurance Corporation Board of Directors",
    "content": "May 31, 2023 - Ottawa, Ontario - Department of Finance Canada\nToday, the Honourable Chrystia Freeland, Deputy Prime Minister and Minister of Finance, announced the appointment of Jeffrey Heath to the Board of Directors of the Canada Deposit Insurance Corporation (CDIC) for a four-year term.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/05/government-announces-appointment-to-the-canada-deposit-insurance-corporation-board-of-directors.html"
  },
  {
    "title": "Government announces lower credit card transaction fees for small businesses",
    "content": "May 18, 2023 - Brampton, Ontario - Department of Finance Canada\nThe Government of Canada today announced it is delivering on the Budget 2023 commitment to lower credit card transaction fees for small businesses by finalizing new agreements with Visa and Mastercard, while also protecting reward points for Canadian consumers offered by Canada’s large banks.\nSmall businesses pay fees to process credit card transactions, with the largest component being the interchange fee paid to credit card-issuing financial institutions, such as banks. These new agreements will help more than 90 per cent of credit card-accepting businesses in Canada qualify for lower rates and see their interchange fees reduced by up to 27 per cent from the existing weighted average rate. These reductions are expected to save eligible Canadian small businesses about $1 billion over five years.\nFor qualifying small businesses, Visa and Mastercard have agreed to:\nSmall businesses will qualify with each credit card network individually. Specifically, small businesses with annual Visa sales volume below $300,000 will qualify for the lower interchange fees from Visa, and those with annual Mastercard sales volume below $175,000 will qualify for the lower fees from Mastercard. Non-profit organizations with transaction volumes below these thresholds will also benefit from reduced rates.\nAs specified in Budget 2023, the government’s expectation is that commitments by credit card networks to lower interchange fees for small businesses will not adversely impact interchange fees paid by other businesses. The government also expects other credit card companies to take similar actions to lower fees for small businesses, and that payment processors will pass these reductions on to small businesses.\nAs part of these new agreements with Visa and Mastercard, Canada’s large banks have agreed to protect Canadians’ reward points.\nThe new rates will come into effect in the fall of 2024 to allow time to complete the required system updates. ",
    "link": "https://www.canada.ca/en/department-finance/news/2023/05/government-announces-lower-credit-card-transaction-fees-for-small-businesses.html"
  },
  {
    "title": "Legislation to provide new Grocery Rebate and strengthen public health care receives Royal Assent",
    "content": "May 11, 2023 - Ottawa, Canada - Department of Finance Canada\nToday, Bill C-46, the Cost of Living Act, No. 3, received Royal Assent. This legislation delivers new inflation relief to the Canadians who need it most through the new Grocery Rebate, and strengthens public health care with a $2 billion Canada Health Transfer (CHT) top-up to help reduce backlogs and wait times, and support pediatric hospitals and emergency rooms.\nThe new one-time Grocery Rebate will deliver targeted inflation relief for 11 million low- and modest-income Canadians and families who need it most, with up to an extra $467 for eligible couples with two children; up to an extra $234 for single Canadians without children; and an extra $225 for seniors, on average. The Grocery Rebate will be delivered to eligible Canadians on July 5, 2023, by direct deposit or cheque through the Canada Revenue Agency.\nThe Cost of Living Act, No. 3, also delivers the previously announced $2 billion CHT top-up, to help provinces and territories deliver the high quality and timely health care Canadians expect and deserve. This additional top-up will help alleviate immediate pressures in health care systems across the country.\nThis additional $2 billion CHT top-up builds on previous CHT top-ups totaling $6.5 billion provided throughout the pandemic, and is part of the federal government’s $198.3 billion plan to improve health care for Canadians. Provinces and territories must not use any of this funding to divert any of their own spending on health care. Provinces and territories are also expected to improve how health information is collected, shared, used, and reported to Canadians to help manage public health emergencies and deliver better health outcomes.  ",
    "link": "https://www.canada.ca/en/department-finance/news/2023/05/legislation-to-provide-new-grocery-rebate-and-strengthen-public-health-care-receives-royal-assent.html"
  },
  {
    "title": "Deputy Prime Minister to attend meeting of G7 Finance Ministers and Central Bank Governors in Japan",
    "content": "May 6, 2023 - Ottawa, Canada - Department of Finance Canada\nNext week, from May 11 to 13, the Deputy Prime Minister and Minister of Finance, the Honourable Chrystia Freeland, will attend the meeting of G7 Finance Ministers and Central Bank Governors in Niigata, Japan.\nAt this meeting, the Deputy Prime Minister and Canada’s G7 partners will discuss how we can work together to friendshore our economies to grow our clean economies and increase our shared economic and energy security. Other topics will include fighting climate change, increasing tax fairness, supporting vulnerable economies, and holding Russia accountable for Putin’s illegal and barbaric full-scale invasion of Ukraine while supporting Ukraine’s economic resilience and reconstruction.\nAn itinerary of events will be released in advance of the meeting.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/05/deputy-prime-minister-to-attend-meeting-of-g7-finance-ministers-and-central-bank-governors-in-japan.html"
  },
  {
    "title": "Deputy Prime Minister to attend meeting of European Union Economy and Finance Ministers in Sweden",
    "content": "April 27, 2023 - Ottawa, - Canada Department of Finance Canada\nThis week, from April 28 to 29, the Deputy Prime Minister and Minister of Finance, the Honourable Chrystia Freeland, will attend a meeting of European Union Economy and Finance Ministers and Central Bank Governors in Stockholm, Sweden.\nThe Deputy Prime Minister has been invited by Sweden, the current President of the Council of the European Union, to discuss the impacts of Russia’s illegal invasion of Ukraine, how best to support the economic stability and reconstruction of Ukraine, and how to further hold Putin and his regime responsible for their criminal war.\nWhile in Stockholm, the Deputy Prime Minister will also meet with partners and allies to discuss the important opportunities for workers and business presented by building the global clean economy, and the role that Canada and Canadian workers can play in providing our allies with the goods and resources they need.\nAn itinerary of events will be released in advance of the meeting.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/04/deputy-prime-minister-to-attend-meeting-of-european-union-economy-and-finance-ministers-in-sweden.html"
  },
  {
    "title": "Government announces appointment of President and Chief Executive Officer of the Canada Deposit Insurance Corporation",
    "content": "April 24, 2023 - Ottawa, Ontario - Department of Finance Canada\nToday, the Honourable Chrystia Freeland, Deputy Prime Minister and Minister of Finance, announced the appointment of Leah Anderson as the President and Chief Executive Officer of the Canada Deposit Insurance Corporation (CDIC) for a five-year term. Ms. Anderson has served as interim President and CEO of CDIC since August 2021.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/04/government-announces-appointment-of-president-and-chief-executive-officer-of-the-canada-deposit-insurance-corporation.html"
  },
  {
    "title": "Government announces appointments to the Royal Canadian Mint Board of Directors",
    "content": "April 24, 2023 - Ottawa, Ontario - Department of Finance Canada\nToday, the Honourable Chrystia Freeland, Deputy Prime Minister and Minister of Finance, announced the reappointment of Phyllis Clark as Chairperson of the Board of Directors of the Royal Canadian Mint for another five-year term, and appointed Evan Price to the Board of Directors of the Royal Canadian Mint for a four-year term.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/04/government-announces-appointments-to-the-royal-canadian-mint-board-of-directors.html"
  },
  {
    "title": "Government bolsters Canada’s foreign reserves by issuing US-dollar global bond",
    "content": "April 21, 2023 - Ottawa, Ontario - Department of Finance Canada\nOn April 19, 2023, the Government of Canada issued a five-year US$4 billion global bond.\nIssuing a global bond provides funds to supplement and diversify funding sources for Canada’s liquid foreign reserves. Liquid foreign reserves are a source of prudential liquidity and promote orderly conditions for the Canadian dollar in foreign exchange markets.\nThe investor base for the five-year bond issue includes a wide range of central banks, international institutions, bank treasuries, and foreign-based investment funds.\nThe issuance of this global bond is in line with the government’s commitment, reiterated in Budget 2023, to maintain liquid foreign reserves at or above three per cent of nominal gross domestic product. \nCanada’s successful US$4 billion global bond issuance will help meet the strong global demand—as evidenced by the final order book of over US$13 billion—for investment opportunities backed by Canada’s AAA credit ratings, while contributing to the stability of Canada’s foreign currency reserves.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/04/government-bolsters-canadas-foreign-reserves-by-issuing-us-dollar-global-bond.html"
  },
  {
    "title": "Government of Canada introduces legislation focused on a strong middle class, affordable economy, and healthy future",
    "content": "April 20, 2023 - Ottawa, Ontario - Department of Finance Canada\nToday, the Government of Canada introduced Bill C-47, the Budget Implementation Act. This central piece of legislation proposes to implement many of the government’s key commitments in Budget 2023.\nIn Bill C-47, the government is continuing to help make life more affordable for Canadians. The Bill includes a suite of measures to help make life more affordable for Canadians by: advancing the new Canadian Dental Care Plan, cracking down on predatory lending and house flipping, providing more support for students, strengthening the Canada Workers Benefit, and doubling the tradespeople’s tool deduction.\nBill C-47 also takes action to:\nIn addition to the measures introduced today in Bill C-47, on April 19, 2023, the House of Commons unanimously approved two key Budget 2023 measures to make life more affordable and strengthen public health care for Canadians:",
    "link": "https://www.canada.ca/en/department-finance/news/2023/04/government-of-canada-introduces-legislation-focused-on-a-strong-middle-class-affordable-economy-and-healthy-future.html"
  },
  {
    "title": "Canada to issue US-dollar global bond",
    "content": "April 18, 2023 - Ottawa, Ontario - Department of Finance Canada\nIn Budget 2023, the Government of Canada reiterated its commitment to maintain liquid foreign reserves at or above three per cent of nominal gross domestic product.\nTo this end, the Government of Canada today announced its intent to issue a US-dollar-denominated global bond tomorrow, April 19, subject to market conditions.\nIssuing a global bond provides funds to supplement and diversify Canada’s liquid foreign reserves, which help promote orderly conditions for the Canadian dollar in foreign exchange markets and provide a source of liquidity to the government, if needed.\nThis US-dollar global bond will contribute to the stability of Canada’s foreign currency reserves, while also meeting the demand of investors seeking investment opportunities that benefit from Canada’s AAA credit rating from most major credit rating agencies.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/04/canada-to-issue-us-dollar-global-bond.html"
  },
  {
    "title": "Minister Boissonnault highlights Budget 2023 investment to help Canadians with higher prices at the checkout counter",
    "content": "April 13, 2023 - Gatineau, Quebec - Department of Finance Canada\nToday, the Honourable Randy Boissonnault, Minister of Tourism and Associate Minister of Finance, visited the Adonis grocery store in Gatineau to talk with local residents and highlight Budget 2023’s investments that will help make life more affordable for Canadians.\nCanada has made a remarkable recovery from the COVID recession. Canada’s economic growth was the strongest in the G7 over the last year, and today, 865,000 more Canadians are employed than before the pandemic, including 136,900 in Quebec. Inflation in Canada has fallen for eight months in a row, our unemployment rate is near its record low, and, supported by our Canada-wide system of affordable early learning and child care, the labour force participation rate for women aged 25 to 54 reached a record high of 85.7 per cent in February.\nHowever, inflation is still making it difficult for many Canadians to make ends meet and put food on the table. Groceries are more expensive today, and for many people, higher prices on other essential goods are causing undue stress. That’s why Budget 2023 provides new, targeted inflation relief for the most vulnerable Canadians to help support them with the cost of living.\nBudget 2023 delivers the new Grocery Rebate, which would offer targeted inflation relief for 11 million Canadians and families who need it most with up to an additional $467 for eligible couples with two children; an additional $234 for single Canadians without children; and an additional $225 for seniors, on average.\nTo make life more affordable, the government is also taking action to crack down on junk fees and predatory lending, lower credit card transaction fees for small businesses, and help Canadians keep more money in their pockets.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/04/minister-boissonnault-highlights-budget-2023-investment-to-help-canadians-with-higher-prices-at-the-checkout-counter.html"
  },
  {
    "title": "Minister Boissonnault and MP Long highlight budget investments in public health care and affordable dental care",
    "content": "April 11, 2023 - Saint John, New Brunswick - Department of Finance Canada\nToday in Saint John, New Brunswick, the Honourable Randy Boissonnault, Minister of Tourism and Associate Minister of Finance, and Wayne Long, Member of Parliament for Saint John—Rothesay, highlighted Budget 2023’s investments in public health care and affordable dental care.\nCanadians are proud of our universal publicly funded health care system. No matter how much money people make, where they were born or what their parents do, they can receive the care they need. However, our public health care system is not delivering the high-quality care that Canadians deserve. For example, surgeries have been postponed or cancelled. Our public health care system, and the workers who uphold it, are under enormous strain. This situation was made worse by the pandemic and requires immediate action.\nTo strengthen Canada’s universal public health care system, the budget delivers $198.3 billion over ten years, including $3.8 billion in New Brunswick, to reduce backlogs, expand access to family health services, and ensure provinces and territories can provide the high-quality and timely health care Canadians expect and deserve.\nBudget 2023 also introduces a new Canadian Dental Care Plan that will begin to roll out by the end of this year and be fully implemented by 2025. This will provide dental coverage to up to nine million Canadians and will ensure no one has to choose between taking care of their health and paying the bills at the end of the month.\nWith these significant investments—as well as new measures to address the shortage of health care professionals in rural and remote communities, safeguard access to abortion and other sexual and reproductive health care services, combat the opioid crisis, and ensure that Canadians can receive critical mental health support—Budget 2023 will help build a healthier Canada from coast to coast to coast.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/04/minister-boissonnault-and-mp-long-highlight-budget-investments-in-public-health-care-and-affordable-dental-care.html"
  },
  {
    "title": "Minister Boissonnault highlights Budget 2023 investments to grow Canada’s clean economy",
    "content": "April 12, 2023 - Saint John, New Brunswick - Department of Finance Canada\nToday, the Honourable Randy Boissonnault, Minister of Tourism and Associate Minister of Finance, met with community and business leaders in Saint John to discuss Budget 2023 and to highlight the government’s plan to build Canada’s clean economy—one that is good for workers, good for business, good for the environment, and which makes life more affordable for all Canadians. \nBudget 2023 investments in abundant and low-cost clean electricity will lay the groundwork needed to create hundreds of thousands of good paying careers, provide the power for the 21st century Canadian economy, and secure more affordable energy for millions of Canadian homes.\nThis made-in-Canada plan is reinforced by a new federal toolkit for investing in the clean economy: a set of clear and predictable investment tax credits, low-cost strategic financing, and targeted investments and programming, where necessary, to respond to the unique needs of sectors or projects of national economic significance.\nTo support and accelerate clean electricity investment, Budget 2023 proposes a 15 per cent refundable tax credit for eligible investments in non-emitting electricity generation systems. Budget 2023 also introduces a refundable tax credit equal to 30 per cent of the cost of investments in machinery and equipment used to manufacture or process key clean technologies, and extract, process, or recycle certain critical minerals essential to clean technology supply chains. \nIn New Brunswick, an important component of ensuring a more sustainable and more affordable electricity grid is the Atlantic Loop. The federal government is committed to advancing the Atlantic Loop—a series of interprovincial transmission lines that will provide clean electricity between New Brunswick, Quebec, and Nova Scotia. The Government of Canada is currently negotiating with New Brunswick, other provinces, and utilities to identify a clear path to deliver the project by 2030.\nWith Budget 2023, investments into Canada’s clean economy will deliver good paying careers, support vibrant communities, and create economic prosperity today and for the next generation. ",
    "link": "https://www.canada.ca/en/department-finance/news/2023/04/minister-boissonnault-highlights-budget-2023-investments-to-grow-canadas-clean-economy.html"
  },
  {
    "title": "Deputy Prime Minister to attend G7 and G20 Finance Ministers’ Meetings and Spring Meetings of the IMF and the World Bank in Washington, D.C.",
    "content": "April 11, 2023 - Ottawa, Canada - Department of Finance Canada\nThis week, from April 12 to 14, the Deputy Prime Minister and Minister of Finance, the Honourable Chrystia Freeland, will visit Washington, D.C., to attend the Spring Meetings of the International Monetary Fund (IMF) and the World Bank.\nWhile in Washington, the Deputy Prime Minister will also attend meetings of G7 and G20 Finance Ministers and Central Bank Governors, as well as meetings of the International Monetary and Financial Committee.\nAt these meetings, the Deputy Prime Minister will work with Canada’s allies and partners to address pressing challenges affecting the Canadian and global economies, including the impacts of global inflation, Russia’s illegal invasion of Ukraine, disruptions to global commodity markets, and climate change.\nThe Deputy Prime Minister will also use these meetings to discuss with our allies the important opportunities for workers and businesses presented by the building of the global clean economy, and the role that Canada and Canadian workers can play in providing our allies with the goods and resources they need.\nAn itinerary of events will be released in advance of the meetings.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/04/deputy-prime-minister-to-attend-g7-and-g20-finance-ministers-meetings-and-spring-meetings-of-the-imf-and-the-world-bank-in-washington-dc.html"
  },
  {
    "title": "Minister Boissonnault highlights budget investments to create good middle class jobs and build Canada’s 21st century clean economy",
    "content": "April 5, 2023 - Edmonton, Alberta - Department of Finance Canada\nToday in Edmonton, the Honourable Randy Boissonnault, Minister of Tourism and Associate Minister of Finance, met with workers at Lehigh Cement, to highlight Budget 2023’s investments toward creating good middle class jobs and in particular the new clean investment tax credits.\nCanada has made a remarkable recovery from the COVID recession. Canada’s economic growth was the strongest in the G7 over the last year, and today, 830,000 more Canadians are employed than before the pandemic, including 128,600 in Alberta. Inflation in Canada has fallen for eight months in a row, our unemployment rate is near its record low, and, supported by our Canada-wide system of affordable early learning and child care, the labour force participation rate for women aged 25 to 54 reached a record high of 85.7 per cent in February.\nBudget 2023 builds on this important progress.\nTo build Canada’s clean economy, the budget makes transformative investments to fight climate change and create new opportunities for Canadian businesses and workers. This includes significant measures that will deliver cleaner and more affordable energy, support investment in our communities, and create good careers.\nIn particular, Budget 2023 proposes a set of clear and predictable investment tax credits, with many of these new credits to be accompanied by provisions to ensure that workers see the benefits of a clean economy. Building on the design details announced last year, Budget 2023 proposes an enhancement to the Investment Tax Credit for Carbon Capture, Utilization, and Storage, with includes the coverage of additional equipment. This will be an important tool for reducing emissions in high-emitting sectors and industrial processes while helping to create good careers.\nBy making these significant investments, Budget 2023 is ensuring a clean Canadian economy can deliver prosperity, middle class jobs, and more vibrant communities across Canada.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/04/minister-boissonnault-highlights-budget-investments-to-create-good-middle-class-jobs-and-build-canadas-21st-century-clean-economy.html"
  },
  {
    "title": "Minister Boissonnault highlights budget investments for a clean economy",
    "content": "April 4, 2023 - Edmonton, Alberta - Department of Finance Canada\nToday, the Honourable Randy Boissonnault, Minister of Tourism and Associate Minister of Finance, met with representatives from the kīsikāw pīsim solar farm in Edmonton to discuss Budget 2023 and the government’s plan to build Canada’s clean economy—one that is good for workers, good for business, good for the environment, and which makes life more affordable for Canadians from coast to coast to coast. \nCurrently, the world’s major economies are moving at an unprecedented pace to fight climate change, retool their economies, and build the net-zero industries of tomorrow. Budget 2023 investments in abundant and low-cost clean electricity will underpin other investments needed to create hundreds of thousands of middle class jobs, provide the energy that will power our daily lives and the entire Canadian economy, and provide more affordable energy to millions upon millions of Canadian homes.\nThis made-in-Canada plan is underpinned by a new federal toolkit for investing in the clean economy: a set of clear and predictable investment tax credits, low-cost strategic financing, and targeted investments and programming, where necessary, to respond to the unique needs of sectors or projects of national economic significance.\nTo support and accelerate clean electricity investment, Budget 2023 proposes to introduce a 15 per cent refundable tax credit for eligible investments in non-emitting electricity generation systems—including solar.\nBudget 2023 also proposes a refundable tax credit equal to 30 per cent of the cost of investments in machinery and equipment used to manufacture or process key clean technologies, and extract, process, or recycle certain critical minerals essential to clean technology supply chains. By making significant investments to ensure Canada does not fall behind at this moment of opportunity, Budget 2023 is ensuring a clean Canadian economy can deliver prosperity, middle class jobs, and more vibrant communities across Canada.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/04/minister-boissonnault-highlights-budget-investments-for-a-clean-economy.html"
  },
  {
    "title": "Minister Boissonnault highlights budget investments to make life more affordable",
    "content": "April 3, 2023 - Edmonton, Alberta - Department of Finance\nToday the Honourable Randy Boissonnault,, the Minister of Tourism and Associate Minister of Finance, met with residents of Edmonton to highlight Budget 2023’s investments aimed at making life more affordable for Canadians.\nCanada has made a remarkable recovery from the COVID recession. Canada’s economic growth was the strongest in the G7 over the last year, and today, 830,000 more Canadians are employed than before the pandemic, including 128,600 here in Alberta. Inflation in Canada has fallen for eight months in a row, our unemployment rate is near its record low, and, supported by our Canada-wide system of affordable early learning and child care, the labour force participation rate for women aged 25 to 54 reached a record high of 85.7 per cent in February.\nBudget 2023 builds on this important progress.\nTo make life more affordable, Budget 2023 delivers the new Grocery Rebate, offering targeted inflation relief for 11 million Canadians and families who need it most with up to an additional $467 for eligible couples with children; an additional $234 for single Canadians without children; and an additional $225 for seniors, on average. The government is also taking action to crack down on junk fees and predatory lending, lower credit card transaction fees for small businesses, and help Canadians keep more money in their pockets.\nTo strengthen Canada’s universal public health care system, the budget delivers $198.3 billion, including $25.096 billion here in Alberta to reduce backlogs, expand access to family health services, and ensure provinces and territories can provide the high quality and timely health care Canadians expect and deserve. Budget 2023 also introduces a new Canadian Dental Care Plan, to help up to nine million Canadians and ensure no Canadian has to choose between taking care of their health and paying the bills at the end of the month.\nTo build Canada’s clean economy, the budget makes transformative investments to fight climate change and create new opportunities for Canadian businesses and workers. This includes significant measures that will deliver cleaner and more affordable energy, support investment in our communities, and create good-paying jobs.\nWith a responsible fiscal plan that will see Canada maintain the lowest deficit and the lowest net debt-to-GDP ratio in the G7, Budget 2023 will help to build a Canada that is more secure, more sustainable, and more affordable for people from coast to coast to coast.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/04/minister-boissonnault-highlights-budget-investments-to-make-life-more-affordable.html"
  },
  {
    "title": "Government of Canada releases Budget 2023",
    "content": "Federal budget will support a stronger middle class, an affordable economy, and a healthy future for Canadians\nMarch 28, 2023 - Ottawa, Ontario - Department of Finance Canada\nToday, the Honourable Chrystia Freeland, Deputy Prime Minister and Minister of Finance, released Budget 2023—A Made-in-Canada Plan: Strong Middle Class, Affordable Economy, Healthy Future.\nCanada has made a remarkable recovery from the COVID recession. Canada’s economic growth was the strongest in the G7 over the last year, and today, 830,000 more Canadians are employed than before the pandemic. Inflation in Canada has fallen for eight months in a row, our unemployment rate is near its record low, and, supported by a Canada-wide system of affordable early learning and child care, the labour force participation rate for women aged 25 to 54 reached a record high of 85.7 per cent in February.\nBudget 2023 builds on this important progress.\nThrough the new Grocery Rebate, Budget 2023 delivers targeted inflation relief for 11 million Canadians and families who need it most, with up to an extra $467 for eligible couples with children; an extra $234 for single Canadians without children; and an extra $225 for seniors, on average. The government also takes action to crack down on hidden junk fees and predatory lending, lower credit card transaction fees for small businesses, and help Canadians keep more money in their pockets.\nTo strengthen Canada’s universal public health care system, Budget 2023 delivers $198.3 billion to reduce backlogs, expand access to family health services, and ensure provinces and territories can provide the high quality and timely health care Canadians expect and deserve. In Budget 2023, the government also introduces a new Canadian Dental Care Plan, to benefit up to nine million Canadians and ensure that no Canadian has to choose between taking care of their health and paying the bills at the end of the month.\nBudget 2023 makes transformative investments to build Canada’s clean economy, fight climate change, and create new opportunities for Canadian businesses and Canadian workers. This includes significant measures that will deliver cleaner and more affordable energy, support investment in our communities and the creation of good-paying jobs, and ensure that Canadian workers are able to produce and provide the goods and resources that Canadians and our allies need.\nWith a responsible fiscal plan that will see Canada maintain the lowest deficit and the lowest net debt-to-GDP ratio in the G7, Budget 2023 will help to build a Canada that is more secure, more sustainable, and more affordable for people from coast to coast to coast.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/03/government-of-canada-releases-budget-2023.html"
  },
  {
    "title": "Canada bans Russian aluminum and steel imports",
    "content": "March 10, 2023 - Ottawa, Canada - Department of Finance Canada\nToday, the Honourable Chrystia Freeland, Deputy Prime Minister and Minister of Finance, announced that Canada is banning the import of Russian aluminum and steel products.\nThrough regulatory amendments under the Special Economic Measures (Russia) Regulations, the importation of all Russian aluminum products, such as unwrought aluminum, aluminum sheets, and finished products including containers and other household items made from aluminum, is now prohibited. Also banned are all primary Russian steel products, including iron and non-alloy steel, semi-finished, and finished products such as tubes and pipes.\nThis ban will further deny Russia the ability to generate the revenues it needs to pay for its war against Ukraine. Canada continues to work alongside its partners and allies to hold Russia accountable.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/03/canada-bans-russian-aluminum-and-steel-imports.html"
  },
  {
    "title": "Government welcomes OECD’s 2023 Economic Survey of Canada",
    "content": "March 6, 2023 - Ottawa, Ontario - Department of Finance Canada\nToday, the Honourable Chrystia Freeland, Deputy Prime Minister and Minister of Finance, welcomed the Organisation for Economic Co-operation and Development (OECD)’s 2023 Economic Survey of Canada.\nThe report highlights Canada’s strong recovery from the pandemic while underscoring the federal government’s fiscal strength, noting that Canada’s “fiscal deficit has declined rapidly” and “recent budgets have included savings through public spending efficiency gains”. Canada’s net debt-to-GDP ratios are well below the average for the OECD, the European Union, and the United States. This continued track record of fiscal strength has allowed the government to continue providing necessary, targeted economic support to help those who need it most.\nThe OECD’s updated economic forecasts positively reflect the resilience of the Canadian economy during a period of global economic uncertainty by projecting an improvement in GDP growth compared to its November forecasts, with growth expected to be 1.3 per cent in 2023 and 1.5 per cent in 2024. The OECD also projects that inflation will return to its target of 2 per cent by the end of 2024.\nThe OECD also commends Canada’s ambitious actions on climate change and recognizes the central role carbon pollution pricing has in Canada’s national climate plan as a way to “reduce emissions at a lower cost than other policies”. The report also emphasizes how “public investment, including in green energy projects, can spur activity and job creation in hard-hit regions”, and that the proposed federal carbon capture, utilization, and storage investment tax credit is “appropriately designed”.\nThe OECD “welcomes” recent investments in health care, including the Canada Dental Benefit, and highlighted Canada’s commitment to moving forward on plans to address key social-economic challenges. In particular, the OECD underscores the importance of the Canada-wide affordable early learning and child care system, which is already helping to reduce gender gaps and make life more affordable for Canadian families.\nFinally, the OECD calls on Canada to continue improving productivity and investment growth, which “has weakened relative to the United States and other leading OECD economies”, and to continue its focus on reducing barriers to internal trade and on harmonizing rules governing trade and labour mobility between provinces and territories to improve competitiveness. The federal government agrees.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/03/government-welcomes-oecds-2023-economic-survey-of-canada.html"
  },
  {
    "title": "Government releases blueprint for Canada Innovation Corporation",
    "content": "February 16, 2023 - Ottawa, Ontario - Department of Finance Canada\nToday, the Honourable Chrystia Freeland, Deputy Prime Minister and Minister of Finance, and the Honourable François-Philippe Champagne, Minister of Innovation, Science and Industry, released a blueprint that will guide the operations of the new Canada Innovation Corporation (CIC).\nIn creating the CIC, the government is following through on its Budget 2022 commitment to establish an innovation agency to drive Canadian business investment in research and development (R&D) and foster economic growth. The CIC will operate with an initial budget of $2.6 billion over four years, and is expected to begin its operations in 2023.\nCanadian research facilities are home to some of the most talented people in their fields in the world. With robust start-up ecosystems across the country and countless firms in commodity-based and traditional sectors that could be transformed into technology-driven global leaders, Canada has all of the fundamentals required to build a stronger and more innovative economy.  \nHowever, Canadian businesses do not invest in R&D to the same degree as their global peers, which weakens Canada’s economic competitiveness and reduces opportunities for Canadian workers. Canadian businesses—including those operating in established commodity-based and manufacturing industries—need enhanced support to make R&D investments that will generate new and improved globally competitive products, processes, and services.\nThe CIC will help Canadian businesses across all sectors and regions to innovate, commercialize, grow, and create good jobs in a changing global economy. Using best practices established by similar agencies around the world, the CIC will be an operationally independent, outcome-driven organization, that will work with the private sector to provide targeted support to new and established Canadian firms by delivering funding and advisory services.\nThe blueprint document released today provides details on how the CIC will operate, with further details on the standing up of the CIC’s operations to be announced in the coming months.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/02/government-releases-blueprint-for-canada-innovation-corporation.html"
  },
  {
    "title": "Department of Finance releases annual Report on Federal Tax Expenditures",
    "content": "February 15, 2023 - Ottawa, Ontario - Department of Finance Canada\nToday, the Department of Finance Canada released its annual estimates of the fiscal cost of federal tax measures in the 2023 Report on Federal Tax Expenditures—Concepts, Estimates and Evaluations.\nThis annual report helps ensure Canadians’ tax dollars are put to good use by an efficient and responsible federal government.\nIn addition to providing transparency about Canada’s tax system, this year’s report contains three analytical papers that evaluate the impact and efficacy of various tax measures designed to support persons with disabilities, Northern residents, and post-secondary students.\nThe release of today’s report coincides with the tabling of the Main Estimates in the House of Commons by the President of the Treasury Board.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/02/department-of-finance-releases-annual-report-on-federal-tax-expenditures.html"
  },
  {
    "title": "Government announces appointment to the Canada Development Investment Corporation Board of Directors",
    "content": "February 15, 2023 - Ottawa, Ontario - Department of Finance Canada\nToday, the Honourable Chrystia Freeland, Deputy Prime Minister and Minister of Finance, announced the appointment of Dwight Ball to the Canada Development Investment Corporation (CDEV) Board of Directors for a four-year term.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/02/government-announces-appointment-to-the-canada-development-investment-corporation-board-of-directors.html"
  },
  {
    "title": "G7 and Australia expand Russian oil price cap to petroleum products, further reducing Russia’s revenues",
    "content": "February 3, 2023 - Ottawa, Ontario - Department of Finance Canada\nToday, Canada, our G7 partners, and Australia are moving forward with two price caps for seaborne Russian-origin petroleum products, which build on the Russian crude oil price cap announced on December 2, 2022. Together, these price caps will further weaken Putin’s ability to fund his illegal and barbaric war against Ukraine.\nAs of February 5, 2023, the maximum price for seaborne Russian-origin petroleum products will be US$100 per barrel for “premium-to-crude” products, and US$45 for “discount-to-crude” petroleum products.\nThese two additional price caps will be enforced in the same manner as the crude oil price cap: by prohibiting buyers who do not abide by the price caps from obtaining services, like shippers’ insurance, from companies in any of the Coalition countries (G7 partners and Australia).\nThe price cap mechanism has been carefully designed to reduce Russian revenues and limit Russia’s ability to fund its war against Ukraine, while also recognizing the importance of stable energy markets and minimizing negative economic impacts. The Coalition will continue to enforce, monitor, and adjust the price caps to ensure their effectiveness.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/02/g7-and-australia-expand-russian-oil-price-cap-to-petroleum-products-further-reducing-russias-revenues.html"
  },
  {
    "title": "Government announces appointments to the Bank of Canada’s Board of Directors ",
    "content": "January 12, 2023 - Ottawa, Ontario - Department of Finance Canada\nToday, the Honourable Chrystia Freeland, Deputy Prime Minister and Minister of Finance, announced the appointment of David Dominy, Ernie Daniels, and Shelley Williams as Directors on the Board of the Bank of Canada.\nThese three appointees bring many years of experience in accounting, capital markets, and financial management from across industries and sectors, including First Nations financial institutions and non-profit organizations.",
    "link": "https://www.canada.ca/en/department-finance/news/2023/01/government-announces-appointments-to-the-bank-of-canadas-board-of-directors.html"
  }
]